<?php

namespace catInBeard\charTranslit;

const ENGRSYM = array(
    "Q" => ":","q" => ";","W" => "Σ","w" => "ς","E" => "Ε","e" => "ε","R" => "Ρ","r" => "ρ",
    "T" => "Τ","t" => "τ","Y" => "Υ","y" => "υ","U" => "Θ","u" => "θ","I" => "Ι","i" => "ι",
    "O" => "Ο","o" => "ο","P" => "Π","p" => "π","A" => "Α","a" => "α","S" => "Σ","s" => "σ",
    "D" => "Δ","d" => "δ","F" => "Φ","f" => "φ","G" => "Γ","g" => "γ","H" => "Η","h" => "η",
    "J" => "Ξ","j" => "ξ","K" => "Κ","k" => "κ","L" => "Λ","l" => "λ","Z" => "Ζ","z" => "ζ",
    "X" => "Χ","x" => "χ","C" => "Ψ","c" => "ψ","V" => "Ω","v" => "ω","B" => "Β","b" => "β",
    "N" => "Ν","n" => "ν","M" => "Μ","m" => "μ"
);

function enToGrSym(string $input): string
{
    return strtr($input, ENGRSYM);
}
