<?php

namespace catInBeard\charTranslit;

//https://unicode-table.com/en/alphabets/greek/
const ENGR = array(
    "A" => "Α","a" => "α","B" => "Β","b" => "β","C" => "Σ",
    "c" => "σ","D" => "Δ","d" => "δ","E" => "Ε","e" => "ε",
    "F" => "Φ","f" => "φ","G" => "Γ","g" => "γ","H" => "Η",
    "h" => "η","I" => "Ι","i" => "ι","J" => "Τζ","j" => "τζ",
    "K" => "Κ","k" => "κ","L" => "Λ","l" => "λ","M" => "Μ",
    "m" => "μ","N" => "Ν","n" => "ν","O" => "Ο","o" => "ο",
    "P" => "Π","p" => "π","Q" => "ΞΟυ","q" => "ξου","R" => "Ρ",
    "r" => "ρ","S" => "Σ","s" => "σ","T" => "Τ","t" => "τ",
    "U" => "Ου","u" => "ου","V" => "Β","v" => "β","W" => "Ω",
    "w" => "ω","X" => "","x" => "","Y" => "Υ","y" => "υ",
    "Z" => "Ζ","z" => "ζ","Th" => "Θ","TH" => "Θ","th" => "θ",
    "Ks" => "Ξ","KS" => "Ξ","ks" => "ξ", "Ch" => "Χ","CH" => "Χ",
    "ch" => "χ","Ps" => "Ψ","PS" => "Ψ","ps" => "ψ"
);

function enToGr(string $input): string
{
    return strtr($input, ENGR);
}
