<?php

namespace catInBeard\charTranslit;

const RUENSYM = array(
    'й' => 'q',    'ц' => 'w',    'у' => 'e',    'к' => 'r',    'е' => 't',
    'н' => 'y',    'г' => 'u',    'ш' => 'i',    'щ' => 'o',    'х' => '[',
    'ъ' => ']',    'ф' => 'a',    'ы' => 's',    'в' => 'd',    'а' => 'f',
    'п' => 'g',    'р' => 'h',    'о' => 'j',    'л' => 'k',    'д' => 'l',
    'ж' => ';',    'э' => "'",    'я' => 'z',    'ч' => 'x',    'с' => 'c',
    'м' => 'v',    'и' => 'b',    'т' => 'n',    'ь' => 'm',    'б' => ',',
    'ю' => '.',    'ё' => '`',    'з' => 'p',
    'А' => 'F',    'Б' => '<',    'В' => 'D',    'Г' => 'U',    'Д' => 'L',
    'Е' => 'T',    'Ё' => '~',    'Ж' => ':',    'З' => 'P',    'И' => 'B',
    'Й' => 'Q',    'К' => 'R',    'Л' => 'K',    'М' => 'V',    'Н' => 'Y',
    'О' => 'J',    'П' => 'G',    'Р' => 'H',    'С' => 'C',    'Т' => 'N',
    'У' => 'E',    'Ф' => 'A',    'Х' => '{',    'Ц' => 'W',    'Ч' => 'X',
    'Ш' => 'I',    'Щ' => 'O',    'Ь' => 'M',    'Ы' => 'S',    'Ъ' => '}',
    'Э' => '"',    'Ю' => '>',    'Я' => 'Z'
);

function ruToEnSym(string $input):string
{
    return strtr($input, RUENSYM);
}